{
  "ui": {
    "search_experience": "Buscar...",
    "experience_intro": "Mi trayectoria profesional es el reflejo de mi curiosidad por entender c贸mo funcionan los sistemas desde adentro. He transitado por el desarrollo de software, la gesti贸n de proyectos y la infraestructura de redes, siempre con la misma premisa: construir soluciones s贸lidas, escalables y estar presente para asegurar su evoluci贸n t茅cnica.",
    "search_formation": "Buscar...",
    "formation_intro": "Mi formaci贸n acad茅mica y certificaciones t茅cnicas. Un registro de mi aprendizaje continuo para entender las bases de la ingenier铆a y las nuevas tecnolog铆as."
  },
  "home": {
    "hi": "Hola, soy",
    "bio": "Desarrollador enfocado en sistemas y servicios inform谩ticos. Apasionado por crear arquitecturas eficientes y garantizar su mantenimiento y evoluci贸n t茅cnica."
  },
  "nodes": {
    "about": "Sobre M铆",
    "experience": "Experiencia",
    "formation": "Formaci贸n",
    "projects": "Proyectos",
    "skills": "Habilidades",
    "technologies": "Tecnolog铆as",
    "interests": "Intereses"
  },
  "player": {
    "now_playing": "Sonando",
    "toast_msg": "Ey, algo m谩s personal: te comparto mi radio en vivo "
  },
  "experience": [
    {
      "id": 9,
      "init_time": "2025",
      "end_time": "Actualidad",
      "position": "SysAdmin e Infraestructura de Redes",
      "empresa": "Internet Plus",
      "comentarios_personales": "Dado el desempe帽o y compromiso que demostr茅 en soporte t茅cnico, se me confi贸 la oportunidad de integrarme al equipo de infraestructura de servicios del ISP. Actualmente me encargo de mantener, controlar y monitorear el n煤cleo de la red, buscando siempre proponer mejoras y soluciones a problemas complejos de infraestructura. He profundizado mis conocimientos en los sistemas utilizados, enfrentando un desaf铆o constante donde pongo en pr谩ctica mis capacidades t茅cnicas para garantizar la estabilidad de un servicio masivo.",
      "tags": ["SysDev", "SysAdmin", "Networking", "IPTV", "ISDBT", "Sistemas Propietarios", "Monitoreo", "Sistemas Embebidos"],
      "type": "infra"
    },
    {
      "id": 8,
      "init_time": "2025",
      "end_time": "2025",
      "position": "Chatbot Developer",
      "empresa": "SEO ARG",
      "comentarios_personales": "En este rol me enfoqu茅 en el desarrollo de soluciones conversacionales a medida. Dise帽茅 chatbots capaces de gestionar clientes y conectarse con sistemas previos de las empresas, incorporando bases de datos para recopilar informaci贸n valiosa que luego ser铆a procesada mediante ciencia de datos. Fue un trabajo minucioso de ajuste de identidad digital, donde utilic茅 diversos scripts y APIs para cumplir con las demandas espec铆ficas de cada flujo de atenci贸n.",
      "tags": ["Python", "JavaScript", "BotMaker", "APIs", "Data Science"],
      "type": "dev"
    },
    {
      "id": 7,
      "init_time": "2024",
      "end_time": "2025",
      "position": "Full Stack Developer - Sistemas Embebidos",
      "empresa": "OLTMyAdmin",
      "comentarios_personales": "Tuve la oportunidad de formar parte de una startup tecnol贸gica en un proyecto sumamente innovador: el desarrollo de un SaaS completo orientado a la gesti贸n de equipos de redes. Trabaj茅 en todo el ciclo, desde la concepci贸n de la infraestructura base hasta el servicio final que recibe el cliente. Junto al equipo, logramos construir demos s贸lidas y funcionalidades completas, integrando hardware, software propietario y entornos de red escalables. Lamentablemente, el proyecto qued贸 pausado por falta de equipamiento t茅cnico para el desarrollo antes de lanzar el producto al mercado, pero la experiencia adquirida fue invaluable para mi crecimiento profesional.",
      "tags": ["Flutter", "Node.js", "Docker", "Sistemas Embebidos", "Networking", "SysDev", "Full Stack", "Linux"],
      "type": "dev"
    },
    {
      "id": 6,
      "init_time": "2023",
      "end_time": "2024",
      "position": "Soporte T茅cnico de Redes",
      "empresa": "Internet Plus",
      "comentarios_personales": "Al finalizar mi formaci贸n universitaria, ingres茅 al mundo de los ISP brindando soporte t茅cnico en redes. M谩s all谩 de los requerimientos t茅cnicos diarios, esta etapa fue fundamental para pulir mis habilidades blandas: el trato directo con las personas y la resoluci贸n de problemas bajo presi贸n. Me permiti贸 conocer desde adentro el funcionamiento integral de una empresa proveedora de internet y lo que implica mantener un servicio activo para miles de usuarios.",
      "tags": ["Networking", "Habilidades de Comunicaci贸n", "Servicio T茅cnico", "ISP"],
      "type": "infra"
    },
    {
      "id": 5,
      "init_time": "2023",
      "end_time": "2023",
      "position": "Desarrollador FrontEnd",
      "empresa": "Finnegans",
      "comentarios_personales": "Me incorpor茅 mediante un contrato temporal para integrar el equipo de desarrollo de una billetera virtual. Trabajando bajo metodolog铆as 谩giles (Scrum), participaba en dailys y segu铆a est谩ndares modernos de desarrollo de software. Mi foco estuvo en el FrontEnd utilizando Angular y gestionando el despliegue con Nginx, asegurando interfaces fluidas y un c贸digo mantenible dentro de un entorno corporativo.",
      "tags": ["Angular", "Nginx", "Git", "Scrum", "Metodolog铆as giles"],
      "type": "dev"
    },
    {
      "id": 4,
      "init_time": "2021",
      "end_time": "2022",
      "position": "Director de Proyecto",
      "empresa": "TecnoBross",
      "comentarios_personales": "En esta etapa asum铆 la responsabilidad de gestionar y dirigir los proyectos que ingresaban a la empresa. Mi labor abarc贸 desde el desarrollo de portales web hasta plataformas de gesti贸n personalizadas, adapt谩ndolas a la presencia digital, el mensaje y la intenci贸n de cada cliente. Adem谩s de la direcci贸n t茅cnica, me encargu茅 de realizar capacitaciones a clientes y personal interno sobre el uso de los componentes web dedicados que desarroll谩bamos, como tambi茅n sobre las buenas pr谩cticas de seguridad inform谩tica para proteger sus activos digitales.",
      "tags": ["Gesti贸n de Proyectos", "Ciberseguridad", "Capacitaciones", "Liderazgo", "Log铆stica", "Planificaci贸n", "WordPress", "Desarrollo Web", "Bases de Datos", "Dise帽o UX/UI"],
      "type": "mgmt"
    },
    {
      "id": 3,
      "init_time": "2020",
      "end_time": "Actualidad",
      "position": "Desarrollador y Gestor de Sistemas",
      "empresa": "Aut贸nomo",
      "comentarios_personales": "Como trabajador independiente, he gestionado diversos contratos enfocados en dar soluciones t茅cnicas a medida. He tenido la oportunidad de trabajar en la creaci贸n de sistemas de monitoreo, bases de datos y scripts de automatizaci贸n, integraci贸n y desarrollo de APIs, entre otras soluciones que sean aut贸nomas y est茅n bien documentadas. Mi compromiso va m谩s all谩 de la entrega inicial, ya que contin煤o brindando asistencia y monitoreo remoto para asegurar el servicio que junto con los sistemas evolucionen acorde con las necesidades del cliente.",
      "tags": ["Python", "JavaScript", "Bases de Datos", "Automatizaci贸n", "APIs", "Sistemas Propietarios", "Monitoreo", "SysDev", "Servicio T茅cnico"],
      "type": "dev"
    },
    {
      "id": 2,
      "init_time": "2020",
      "end_time": "Actualidad",
      "position": "Servicio T茅cnico Inform谩tico",
      "empresa": "Aut贸nomo",
      "comentarios_personales": "A la par de mi labor como desarrollador, mantengo una cartera de clientes de confianza que recurren a m铆 para el mantenimiento correctivo y preventivo de sus equipos. Me encargo de la instalaci贸n, reparaci贸n y optimizaci贸n de hardware, estableciendo una relaci贸n basada en la confianza y el conocimiento t茅cnico profundo de sus estaciones de trabajo y necesidades particulares.",
      "tags": ["Hardware", "Software", "Mantenimiento", "Reparaci贸n", "Servicio T茅cnico"],
      "type": "infra"
    },
    {
      "id": 1,
      "init_time": "2016",
      "end_time": "2021",
      "position": "Ayudante de C谩tedra - Programaci贸n I",
      "empresa": "UTN FRCON",
      "comentarios_personales": "Durante mis a帽os universitarios, form茅 parte activa del equipo docente de la c谩tedra de Programaci贸n I. Mi rol consist铆a en brindar asistencia directa a los alumnos en sus primeros pasos con la programaci贸n, compartiendo ideas y opiniones para mejorar la din谩mica de aprendizaje. Fue una experiencia enriquecedora donde no solo ense帽茅 Python y l贸gica, sino que aprend铆 a transmitir conceptos complejos de una forma clara y colaborativa.",
      "tags": ["Python", "Docencia", "Mentor铆a", "Habilidades de Comunicaci贸n"],
      "type": "edu"
    }
  ],
"formation": [
    {
      "id": 1,
      "init_time": "2015",
      "end_time": "2024",
      "position": "Ingenier铆a en Sistemas de Informaci贸n",
      "empresa": "UTN Facultad Regional Concordia",
      "comentarios_personales": "Cursado completo de la carrera, donde adquir铆 las bases de la l贸gica, algoritmos, redes y gesti贸n de proyectos. Esta etapa fue clave para desarrollar un pensamiento anal铆tico y la capacidad de resolver problemas complejos desde una base te贸rica s贸lida.",
      "type": "degree"
    }
  ]
}